app/views/home/index.html.erb

SELECT COUNT(*) FROM "courses"
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "clients"
---
    <div class="stat-counter">
        Mamy <%= Course.count %> kursów i <%= User.count %> zarejstrowanych użytkowników, <br>
        a nasza strona ma już <%= Client.count %> odwiedzin