app/controllers/courses_controller.rb

  def show
    @films = Film.all
---
SELECT "films".* FROM "films"

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("title", "desc", "created_at", "updated_at", "cover_url") VALUES (?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      if @course.update(course_params)
---
UPDATE "courses" SET "updated_at" = ?, "cover_url" = ? WHERE "courses"."id" = ?  [["updated_at", "2023-12-02 18:44:59.163068"], ["cover_url", "https://www.syncfusion.com/blogs/wp-content/uploads/2018/08/directx_89859d36.png"], ["id", 2]]

  def destroy
    @course.destroy!
---
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 1]]