app/controllers/films_controller.rb

  def create
    @film = Film.new(film_params)

    respond_to do |format|
      if @film.save
---
INSERT INTO "films" ("title", "desc", "video_url", "created_at", "updated_at", "course_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      if @film.update(film_params)
---
UPDATE "films" SET "video_url" = ?, "updated_at" = ? WHERE "films"."id" = ?  [["video_url", "https://www.youtube.com/watch?v=55S6hA0dkF4"], ["updated_at", "2023-11-27 20:14:54.396810"], ["id", 2]]

  def destroy
    @film.destroy!
---
DELETE FROM "films" WHERE "films"."id" = ?  [["id", 1]]

    def set_film
      @film = Film.find(params[:id])
---
SELECT "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]