app/controllers/home_controller.rb

INSERT INTO "clients" ("browser", "os", "dev_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["browser", "Chrome"], ["os", "GNU/Linux"], ["dev_type", "desktop"], ["created_at", "2023-12-13 17:03:05.167779"], ["updated_at", "2023-12-13 17:03:05.167779"]]
---
    def index
        ua = request.user_agent

        cc = DeviceDetector.new(ua) #Stands for current client

        Client.create(:browser => cc.name, :os => cc.os_name, :dev_type => cc.device_type)